`terraform plan -var-file=tfvars/production.tfvars`

```

  # github_branch_protection.this["django-commons-playground"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "django-commons-playground"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # github_branch_protection.this["membership"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "membership"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
        }
    }

  # github_membership.this["cunla"] will be created
  + resource "github_membership" "this" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "admin"
      + username             = "cunla"
    }

  # github_membership.this["tim-schilling"] will be created
  + resource "github_membership" "this" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "admin"
      + username             = "tim-schilling"
    }

  # github_organization_security_manager.this will be created
  + resource "github_organization_security_manager" "this" {
      + id        = (known after apply)
      + team_slug = (known after apply)
    }

  # github_repository.this[".github"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A Special Repository."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = ".github"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.this["controls"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "The controls for managing Django Commons projects"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "controls"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.this["django-commons-playground"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A sample project to test things out"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "django-commons-playground"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.this["membership"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Membership repository for the django-commons organization."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "membership"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository_file.security_policy[".github"] will be created
  + resource "github_repository_file" "security_policy" {
      + branch              = "main"
      + commit_author       = "Open Source Infrastructure as Code Service Account"
      + commit_email        = "github-sa@osinfra.io"
      + commit_message      = "Update SECURITY.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # <img align="left" width="45" height="45" src="https://github.com/osinfra-io/terraform-google-cloud-sql/assets/1610100/ef899efa-b2ce-4c31-83cf-debefadd481d"> Security Policy

            Open Source Infrastructure (as Code) exposes identifying information that would not be exposed in a traditional
            private organization to share knowledge and best practices. This is a net positive for
            the community, but it does come with some risks.

            ## Reporting a Vulnerability

            Privately discuss, fix, and publish information about security vulnerabilities in this repository by drafting a new
            [security advisory](https://github.com/osinfra-io/.github/security/advisories/new).
        EOT
      + file                = "SECURITY.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = ".github"
      + sha                 = (known after apply)
    }

  # github_repository_file.security_policy["controls"] will be created
  + resource "github_repository_file" "security_policy" {
      + branch              = "main"
      + commit_author       = "Open Source Infrastructure as Code Service Account"
      + commit_email        = "github-sa@osinfra.io"
      + commit_message      = "Update SECURITY.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # <img align="left" width="45" height="45" src="https://github.com/osinfra-io/terraform-google-cloud-sql/assets/1610100/ef899efa-b2ce-4c31-83cf-debefadd481d"> Security Policy

            Open Source Infrastructure (as Code) exposes identifying information that would not be exposed in a traditional
            private organization to share knowledge and best practices. This is a net positive for
            the community, but it does come with some risks.

            ## Reporting a Vulnerability

            Privately discuss, fix, and publish information about security vulnerabilities in this repository by drafting a new
            [security advisory](https://github.com/osinfra-io/controls/security/advisories/new).
        EOT
      + file                = "SECURITY.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "controls"
      + sha                 = (known after apply)
    }

  # github_repository_file.security_policy["django-commons-playground"] will be created
  + resource "github_repository_file" "security_policy" {
      + branch              = "main"
      + commit_author       = "Open Source Infrastructure as Code Service Account"
      + commit_email        = "github-sa@osinfra.io"
      + commit_message      = "Update SECURITY.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # <img align="left" width="45" height="45" src="https://github.com/osinfra-io/terraform-google-cloud-sql/assets/1610100/ef899efa-b2ce-4c31-83cf-debefadd481d"> Security Policy

            Open Source Infrastructure (as Code) exposes identifying information that would not be exposed in a traditional
            private organization to share knowledge and best practices. This is a net positive for
            the community, but it does come with some risks.

            ## Reporting a Vulnerability

            Privately discuss, fix, and publish information about security vulnerabilities in this repository by drafting a new
            [security advisory](https://github.com/osinfra-io/django-commons-playground/security/advisories/new).
        EOT
      + file                = "SECURITY.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "django-commons-playground"
      + sha                 = (known after apply)
    }

  # github_repository_file.security_policy["membership"] will be created
  + resource "github_repository_file" "security_policy" {
      + branch              = "main"
      + commit_author       = "Open Source Infrastructure as Code Service Account"
      + commit_email        = "github-sa@osinfra.io"
      + commit_message      = "Update SECURITY.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # <img align="left" width="45" height="45" src="https://github.com/osinfra-io/terraform-google-cloud-sql/assets/1610100/ef899efa-b2ce-4c31-83cf-debefadd481d"> Security Policy

            Open Source Infrastructure (as Code) exposes identifying information that would not be exposed in a traditional
            private organization to share knowledge and best practices. This is a net positive for
            the community, but it does come with some risks.

            ## Reporting a Vulnerability

            Privately discuss, fix, and publish information about security vulnerabilities in this repository by drafting a new
            [security advisory](https://github.com/osinfra-io/membership/security/advisories/new).
        EOT
      + file                = "SECURITY.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "membership"
      + sha                 = (known after apply)
    }

  # github_team.children["django-community-playground-admins"] will be created
  + resource "github_team" "children" {
      + create_default_maintainer = false
      + description               = "django-community-playground administrators"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "django-community-playground-admins"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.children["django-community-playground-committers"] will be created
  + resource "github_team" "children" {
      + create_default_maintainer = false
      + description               = "django-community-playground committers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "django-community-playground-committers"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.parents["admins"] will be created
  + resource "github_team" "parents" {
      + create_default_maintainer = false
      + description               = "django-commons administrators"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "admins"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.parents["django-community-playground"] will be created
  + resource "github_team" "parents" {
      + create_default_maintainer = false
      + description               = "django-community-playground team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "django-community-playground"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.parents["security-team"] will be created
  + resource "github_team" "parents" {
      + create_default_maintainer = false
      + description               = "django-commons security team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "security-team"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.children["django-community-playground-admins"] will be created
  + resource "github_team_members" "children" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Stormheg"
        }
      + members {
          + role     = "maintainer"
          + username = "cunla"
        }
      + members {
          + role     = "maintainer"
          + username = "ryancheley"
        }
      + members {
          + role     = "maintainer"
          + username = "tim-schilling"
        }
      + members {
          + role     = "maintainer"
          + username = "williln"
        }
    }

  # github_team_members.children["django-community-playground-committers"] will be created
  + resource "github_team_members" "children" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Stormheg"
        }
      + members {
          + role     = "maintainer"
          + username = "cunla"
        }
      + members {
          + role     = "maintainer"
          + username = "ryancheley"
        }
      + members {
          + role     = "maintainer"
          + username = "tim-schilling"
        }
      + members {
          + role     = "maintainer"
          + username = "williln"
        }
      + members {
          + role     = "member"
          + username = "priyapahwa"
        }
    }

  # github_team_members.parents["admins"] will be created
  + resource "github_team_members" "parents" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Stormheg"
        }
      + members {
          + role     = "maintainer"
          + username = "cunla"
        }
      + members {
          + role     = "maintainer"
          + username = "ryancheley"
        }
      + members {
          + role     = "maintainer"
          + username = "tim-schilling"
        }
      + members {
          + role     = "maintainer"
          + username = "williln"
        }
    }

  # github_team_members.parents["django-community-playground"] will be created
  + resource "github_team_members" "parents" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Stormheg"
        }
      + members {
          + role     = "maintainer"
          + username = "cunla"
        }
      + members {
          + role     = "maintainer"
          + username = "ryancheley"
        }
      + members {
          + role     = "maintainer"
          + username = "tim-schilling"
        }
      + members {
          + role     = "maintainer"
          + username = "williln"
        }
      + members {
          + role     = "member"
          + username = "priyapahwa"
        }
    }

  # github_team_members.parents["security-team"] will be created
  + resource "github_team_members" "parents" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "tim-schilling"
        }
    }

  # github_team_repository.children["django-community-playground-admins-django-community-playground"] will be created
  + resource "github_team_repository" "children" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "django-community-playground"
      + team_id    = (known after apply)
    }

  # github_team_repository.children["django-community-playground-committers-django-community-playground"] will be created
  + resource "github_team_repository" "children" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "django-community-playground"
      + team_id    = (known after apply)
    }

  # github_team_repository.parents["django-community-playground-django-community-playground"] will be created
  + resource "github_team_repository" "parents" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "django-community-playground"
      + team_id    = (known after apply)
    }

  # github_team_settings.this["django-community-playground"] will be created
  + resource "github_team_settings" "this" {
      + id        = (known after apply)
      + team_id   = (known after apply)
      + team_slug = (known after apply)
      + team_uid  = (known after apply)

      + review_request_delegation {
          + algorithm    = "LOAD_BALANCE"
          + member_count = 2
          + notify       = false
        }
    }

  # time_rotating.this will be created
  + resource "time_rotating" "this" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 5
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```